#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_secgroup_v2.ssh: Refreshing state... [id=f4091969-aab8-4e55-a56e-316aba5adfa0]
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=ccd46ca0-7e78-4567-b46f-8ec7fcec9bc2]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.13.102" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "brno1" -> (known after apply)
      ~ flavor_name         = "standard.medium" -> (known after apply)
      ~ id                  = "ccd46ca0-7e78-4567-b46f-8ec7fcec9bc2" -> (known after apply)
      ~ image_name          = "ubuntu-bionic-x86_64" -> (known after apply)
        name                = "cloud-info"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "b2b26e2b74057f5d8e5a7a0dea23a4dfd3cf2a10" -> "8979767c3fa36b6fdbaf80ff3a2310841132db1b" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.13.102" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:df:68:6b" -> (known after apply)
          ~ name           = "demofedcloud" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*